Repository: Open-Application/OpenApp
Catalog: lib/l10n/app_*.arb
Languages: fa, ms

source: Dashboard
fa: داشبورد
ms: Papan Pemuka

source: Profile
fa: پروفایل
ms: Profil

source: Connect
fa: اتصال
ms: Sambung

source: Disconnect
fa: قطع اتصال
ms: Putuskan Sambungan

source: Connecting...
fa: در حال اتصال...
ms: Menyambung...

source: Disconnecting...
fa: در حال قطع اتصال...
ms: Memutuskan Sambungan...

source: Connected
fa: متصل شد
ms: Disambung

source: Disconnected
fa: قطع شد
ms: Terputus

source: Encrypted
fa: رمزنگاری شده
ms: Disulitkan

source: Unprotected
fa: محافظت نشده
ms: Tidak Dilindungi

source: Service permission required
fa: مجوز سرویس لازم است
ms: Kebenaran perkhidmatan diperlukan

source: Failed to start service
fa: راه‌اندازی سرویس ناموفق بود
ms: Gagal memulakan perkhidmatan

# noNetworkConnection
source: No network connection. Please check your Wi-Fi or mobile data.
fa: اتصال شبکه وجود ندارد. لطفاً Wi-Fi یا داده موبایل خود را بررسی کنید.
ms: Tiada sambungan rangkaian. Sila periksa Wi-Fi atau data mudah alih anda.

source: Settings
fa: تنظیمات
ms: Tetapan

source: Dark Mode
fa: حالت تاریک
ms: Mod Gelap

# aboutProject
source: About {projectName}
fa: درباره {projectName}
ms: Perihal {projectName}

source: Version
fa: نسخه
ms: Versi

# openSourceLicense
source: License
fa: مجوز
ms: Lesen

source: Core Library
fa: کتابخانه اصلی
ms: Perpustakaan Teras

source: Terms of Use
fa: شرایط استفاده
ms: Terma Penggunaan

source: Privacy Policy
fa: سیاست حریم خصوصی
ms: Dasar Privasi

source: Status
fa: وضعیت

source: Control
fa: کنترل
ms: Kawalan

source: Network control center
fa: مرکز کنترل شبکه
ms: Pusat kawalan rangkaian

# connectionStatus
source: Status
fa: وضعیت

# yourInternetIsSecure
source: Your network connection is protected
fa: اتصال شبکه شما محافظت شده است
ms: Sambungan rangkaian anda dilindungi

# yourInternetIsExposed
source: Your network connection is vulnerable
fa: اتصال شبکه شما آسیب‌پذیر است
ms: Sambungan rangkaian anda terdedah

source: Establishing secure connection
fa: در حال برقراری اتصال امن
ms: Mewujudkan sambungan selamat

source: Closing secure connection
fa: در حال بستن اتصال امن
ms: Menutup sambungan selamat

source: Language
fa: زبان
ms: Bahasa

source: Chinese
fa: 中文
ms: 中文

source: System Default
fa: پیش‌فرض سیستم
ms: Lalai Sistem

source: Select Language
fa: انتخاب زبان
ms: Pilih Bahasa

# privacy
source: Privacy and Support
fa: حریم خصوصی و پشتیبانی
ms: Privasi dan Sokongan

source: About
fa: درباره
ms: Perihal

source: Data Collection
fa: جمع‌آوری داده
ms: Pengumpulan Data

# dataCollectionText
source: We do not collect or store any personal information. All network configurations are stored locally on your device.
fa: ما هیچ اطلاعات شخصی جمع‌آوری یا ذخیره نمی‌کنیم. تمام تنظیمات شبکه به صورت محلی روی دستگاه شما ذخیره می‌شود.
ms: Kami tidak mengumpul atau menyimpan sebarang maklumat peribadi. Semua konfigurasi rangkaian disimpan secara tempatan pada peranti anda.

source: Network Traffic
fa: ترافیک شبکه
ms: Trafik Rangkaian

# networkTrafficText
source: This educational tool processes network traffic locally for learning purposes. No data is transmitted to external servers for tracking or analytics.
fa: این ابزار آموزشی ترافیک شبکه را به صورت محلی برای اهداف یادگیری پردازش می‌کند. هیچ داده‌ای برای ردیابی یا تجزیه و تحلیل به سرورهای خارجی ارسال نمی‌شود.
ms: Alat pendidikan ini memproses trafik rangkaian secara tempatan untuk tujuan pembelajaran. Tiada data dihantar ke pelayan luar untuk penjejakan atau analitik.

source: Third-Party Services
fa: سرویس‌های شخص ثالث
ms: Perkhidmatan Pihak Ketiga

# thirdPartyServicesText
source: We do not share any information with third parties. All operations are performed locally on your device.
fa: ما هیچ اطلاعاتی را با اشخاص ثالث به اشتراک نمی‌گذاریم. تمام عملیات به صورت محلی روی دستگاه شما انجام می‌شود.
ms: Kami tidak berkongsi sebarang maklumat dengan pihak ketiga. Semua operasi dilakukan secara tempatan pada peranti anda.

source: Data Security
fa: امنیت داده
ms: Keselamatan Data

# dataSecurityText
source: All configurations and settings are encrypted and stored securely on your device using industry-standard encryption methods.
fa: تمام تنظیمات و پیکربندی‌ها با استفاده از روش‌های رمزنگاری استاندارد صنعتی رمزنگاری و به طور ایمن روی دستگاه شما ذخیره می‌شوند.
ms: Semua konfigurasi dan tetapan disulitkan dan disimpan dengan selamat pada peranti anda menggunakan kaedah penyulitan standard industri.

source: Educational Use Only
fa: فقط برای استفاده آموزشی
ms: Penggunaan Pendidikan Sahaja

# educationalUseOnlyText
source: This software is provided for educational and research purposes only. Users must comply with all applicable laws and regulations.
fa: این نرم‌افزار فقط برای اهداف آموزشی و پژوهشی ارائه شده است. کاربران باید از تمام قوانین و مقررات قابل اجرا پیروی کنند.
ms: Perisian ini disediakan untuk tujuan pendidikan dan penyelidikan sahaja. Pengguna mesti mematuhi semua undang-undang dan peraturan yang berkenaan.

source: No Warranty
fa: بدون ضمانت
ms: Tiada Jaminan

# noWarrantyText
source: The software is provided "as is" without warranty of any kind. We are not responsible for any damages arising from its use.
fa: نرم‌افزار "همان‌طور که هست" بدون هیچ گونه ضمانتی ارائه می‌شود. ما مسئول هیچ گونه خسارت ناشی از استفاده از آن نیستیم.
ms: Perisian disediakan "seadanya" tanpa jaminan apa-apa jenis. Kami tidak bertanggungjawab atas sebarang kerosakan yang timbul daripada penggunaannya.

source: User Responsibility
fa: مسئولیت کاربر
ms: Tanggungjawab Pengguna

# userResponsibilityText
source: Users are responsible for ensuring their use of this tool complies with local regulations and institutional policies.
fa: کاربران مسئول اطمینان از انطباق استفاده از این ابزار با مقررات محلی و سیاست‌های سازمانی هستند.
ms: Pengguna bertanggungjawab memastikan penggunaan alat ini mematuhi peraturan tempatan dan dasar institusi.

source: Academic Integrity
fa: صداقت علمی
ms: Integriti Akademik

# academicIntegrityText
source: This tool should be used in accordance with academic integrity guidelines and ethical research practices.
fa: این ابزار باید مطابق با دستورالعمل‌های صداقت علمی و شیوه‌های تحقیق اخلاقی استفاده شود.
ms: Alat ini harus digunakan mengikut garis panduan integriti akademik dan amalan penyelidikan etika.

source: Close
fa: بستن
ms: Tutup

source: Purpose
fa: هدف
ms: Tujuan

source: Educational
fa: آموزشی
ms: Pendidikan

source: Technology
fa: فناوری
ms: Teknologi

source: Network Research
fa: تحقیقات شبکه
ms: Penyelidikan Rangkaian

source: STOPPED
fa: متوقف شد
ms: DIHENTIKAN

# started
source: CONNECTED
fa: متصل شد
ms: DISAMBUNG

# starting
source: CONNECTING
fa: در حال اتصال
ms: MENYAMBUNG

# stopping
source: DISCONNECTING
fa: در حال قطع
ms: MEMUTUSKAN

source: Active
fa: فعال
ms: Aktif

source: Inactive
fa: غیرفعال
ms: Tidak Aktif

source: Mobile
fa: موبایل
ms: Mudah Alih

source: Desktop
fa: دسکتاپ

source: Service Logs
fa: گزارش‌های سرویس
ms: Log Perkhidmatan

source: Logs
fa: گزارش‌ها
ms: Log

source: Copy logs
fa: کپی گزارش‌ها
ms: Salin log

source: Logs copied to clipboard
fa: گزارش‌ها در کلیپ‌بورد کپی شد
ms: Log disalin ke papan keratan

source: No logs yet
fa: هنوز گزارشی وجود ندارد
ms: Tiada log lagi

# logEntries
source: {count} log entries
fa: {count} ورودی گزارش
ms: {count} entri log

source: Account management hub
fa: مرکز مدیریت حساب
ms: Pusat pengurusan akaun

# aboutProjectText
source: {projectName} is an educational network security tool designed to help users understand privacy protection and secure network communications. This application is intended for educational and research purposes, enabling users to learn about network protocols, encryption, and privacy technologies. All operations are performed locally on your device in compliance with applicable laws and regulations.
fa: {projectName} یک ابزار آموزشی امنیت شبکه است که برای کمک به کاربران در درک حفاظت از حریم خصوصی و ارتباطات امن شبکه طراحی شده است. این برنامه برای اهداف آموزشی و تحقیقاتی در نظر گرفته شده است و به کاربران امکان می‌دهد در مورد پروتکل‌های شبکه، رمزنگاری و فناوری‌های حریم خصوصی بیاموزند. تمام عملیات به صورت محلی روی دستگاه شما مطابق با قوانین و مقررات قابل اجرا انجام می‌شود.
ms: {projectName} ialah alat keselamatan rangkaian pendidikan yang direka untuk membantu pengguna memahami perlindungan privasi dan komunikasi rangkaian selamat. Aplikasi ini bertujuan untuk tujuan pendidikan dan penyelidikan, membolehkan pengguna mempelajari protokol rangkaian, penyulitan, dan teknologi privasi. Semua operasi dilakukan secara tempatan pada peranti anda mematuhi undang-undang dan peraturan yang berkenaan.

source: Configuration
fa: پیکربندی
ms: Konfigurasi

# configurationRequired
source: Configuration is required to connect
fa: برای اتصال پیکربندی لازم است
ms: Konfigurasi diperlukan untuk menyambung

source: User Configuration
fa: پیکربندی کاربر
ms: Konfigurasi Pengguna

# enterBase64Config
source: Enter Base64 Encoded Config
fa: پیکربندی رمزگذاری شده Base64 را وارد کنید
ms: Masukkan Konfigurasi Berkod Base64

# pasteConfigHere
source: Paste your base64 encoded configuration here
fa: پیکربندی رمزگذاری شده base64 خود را اینجا قرار دهید
ms: Tampal konfigurasi berkod base64 anda di sini

# saveConfiguration
source: Save
fa: ذخیره
ms: Simpan

source: Clear Configuration
fa: پاک کردن پیکربندی
ms: Kosongkan Konfigurasi

# configSaved
source: Configuration saved successfully
fa: پیکربندی با موفقیت ذخیره شد
ms: Konfigurasi berjaya disimpan

# configCleared
source: Configuration cleared
fa: پیکربندی پاک شد
ms: Konfigurasi dikosongkan

# configEmpty
source: Configuration cannot be empty
fa: پیکربندی نمی‌تواند خالی باشد
ms: Konfigurasi tidak boleh kosong

source: Config Status
fa: وضعیت پیکربندی
ms: Status Konfigurasi

# customConfig
source: Saved
fa: ذخیره شده
ms: Disimpan

# noCustomConfig
source: No saved config
fa: پیکربندی ذخیره شده وجود ندارد
ms: Tiada konfigurasi tersimpan

# serviceDataPrivacy
source: {appName} Network Connect Data Privacy
fa: {appName} حریم خصوصی داده‌های اتصال شبکه
ms: {appName} Privasi Data Sambungan Rangkaian

# serviceDataCollectionTitle
source: What user information is the app collecting using the service?
fa: برنامه با استفاده از سرویس چه اطلاعات کاربری جمع‌آوری می‌کند؟
ms: Apakah maklumat pengguna yang dikumpulkan oleh aplikasi menggunakan perkhidmatan?

# serviceDataCollectionAnswer
source: This application does NOT collect any user information through the service. All network traffic processing is performed locally on your device. No browsing history, personal data, or identifiable information is collected, logged, or transmitted.
fa: این برنامه از طریق سرویس هیچ اطلاعات کاربری جمع‌آوری نمی‌کند. تمام پردازش ترافیک شبکه به صورت محلی در دستگاه شما انجام می‌شود. تاریخچه مرور، داده‌های شخصی یا اطلاعات قابل شناسایی جمع‌آوری، ثبت یا منتقل نمی‌شود.
ms: Aplikasi ini TIDAK mengumpulkan sebarang maklumat pengguna melalui perkhidmatan. Semua pemprosesan trafik rangkaian dilakukan secara tempatan di peranti anda. Sejarah pelayaran, data peribadi atau maklumat yang boleh dikenal pasti tidak dikumpulkan, direkodkan atau dihantar.

# serviceDataPurposeTitle
source: For what purposes is this information collected?
fa: این اطلاعات برای چه اهدافی جمع‌آوری می‌شود؟
ms: Untuk tujuan apakah maklumat ini dikumpulkan?

# serviceDataPurposeAnswer
source: Since no user data is collected, there are no purposes for data collection. The service functionality is used solely to route network traffic according to your configuration for educational and privacy protection purposes. All operations are local to your device.
fa: از آنجایی که داده کاربری جمع‌آوری نمی‌شود، هیچ هدفی برای جمع‌آوری داده وجود ندارد. عملکرد سرویس صرفاً برای هدایت ترافیک شبکه بر اساس پیکربندی شما برای اهداف آموزشی و حفاظت از حریم خصوصی استفاده می‌شود. تمام عملیات به صورت محلی در دستگاه شما انجام می‌شود.
ms: Oleh kerana tiada data pengguna dikumpulkan, tiada tujuan untuk pengumpulan data. Fungsi perkhidmatan digunakan semata-mata untuk mengarahkan trafik rangkaian mengikut konfigurasi anda untuk tujuan pendidikan dan perlindungan privasi. Semua operasi dilakukan secara tempatan pada peranti anda.

# serviceDataSharingTitle
source: Will the data be shared with any third parties?
fa: آیا داده‌ها با اشخاص ثالث به اشتراک گذاشته می‌شود؟
ms: Adakah data akan dikongsi dengan mana-mana pihak ketiga?

# serviceDataSharingAnswer
source: No data is shared with any third parties because no data is collected. This application operates entirely locally on your device and does not transmit any user information to external servers. Your privacy is completely protected.
fa: هیچ داده‌ای با اشخاص ثالث به اشتراک گذاشته نمی‌شود زیرا هیچ داده‌ای جمع‌آوری نمی‌شود. این برنامه کاملاً به صورت محلی در دستگاه شما کار می‌کند و هیچ اطلاعات کاربری به سرورهای خارجی منتقل نمی‌کند. حریم خصوصی شما کاملاً محافظت می‌شود.
ms: Tiada data dikongsi dengan mana-mana pihak ketiga kerana tiada data dikumpulkan. Aplikasi ini beroperasi sepenuhnya secara tempatan di peranti anda dan tidak menghantar sebarang maklumat pengguna ke pelayan luaran. Privasi anda dilindungi sepenuhnya.

source: Agree
fa: موافقم
